---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityStructType
source: html/81a0ba19-cbe5-69b8-2dbf-8b2fc84edafa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityStructType Property

"Structural Type Name"

## Syntax (C#)
```csharp
public static ForgeTypeId ImportAdtEntityStructType { get; }
```